app/views/orders/new.html.erb

					</tr>
					<% category.items.each do |item| %>
---
SELECT `items`.* FROM `items` WHERE `items`.`category_id` IN (1, 2, 3, 4, 5)