app/controllers/orders_controller.rb

	def new
		@categories = Category.all.includes(:items)
---
SELECT `categories`.* FROM `categories`
SELECT `items`.* FROM `items` WHERE `items`.`category_id` IN (1, 2, 3, 4, 5)

	def create
		@order = Order.new(order_params)
		@order.save
---
INSERT INTO `orders` (`created_at`, `updated_at`) VALUES ('2021-07-11 07:20:10', '2021-07-11 07:20:10')

	def show
		@order_items = @order.order_items.includes(:item)
---
SELECT `items`.* FROM `items` WHERE `items`.`id` IN (1, 2, 4, 5, 7, 10, 11, 12)
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 2

	def destroy
		@order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 2

	def complete
		@order.update_attributes(status: Order.statuses[:payment_completed])
---
UPDATE `orders` SET `status` = 1, `updated_at` = '2021-07-11 21:31:34' WHERE `orders`.`id` = 6

    def set_order
    	@order = Order.find_by_id(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 6 LIMIT 1